Revit 2026 API

# AnalysisDisplayColorEntry Properties

---

The AnalysisDisplayColorEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | Color associated with color entry. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Value | Value associated with color entry. |

#### Reference

AnalysisDisplayColorEntry Class

Autodesk.Revit.DB.Analysis Namespace